# 1) შექმენით სია და დაამატეთ რამდენიმე სახელი. გამოიყენეთ sorted() ფუნქცია, რომ ამ სახელების პირველი ასოს მიხედვით დალაგდეს ეს სახელები (ანბანის მიხედვით)

# 2) პირველი დავალება გაიმეორეთ, ოღონდ მიღებული შედეგი Indexing-ის საშუალებით შეაბრუნეთ.

# 3) შექმენით რიცხვების სია და დაამატეთ რიცხვები კლების მიხედვით, თქვენი მიზანი იქნება ეს რიცხვები ზრდადობის მიხედვით დაალაგოთ.

# 4) შექმენით რიცხვების სია და დაამატეთ  მინიმუმ 10 რიცხვი ზრდადობის მიხედვით, თქვენი მიზანი იქნება ეს რიცხვები კლებადობის მიხედვით დაალაგოთ


#1)# mylist = ["Mari", "Ani", "Nia", "Lika", "Gio", "Mate", ]
# print(sorted(mylist))


 #2)# mylist = ["Mari", "Ani", "Nia", "Lika", "Gio", "Mate", ]
# print(sorted(mylist)[::-1])


 #3)# mylist = [10, 9, 8, 7, 6, 5, 4, 3, 2, 1]
# print(sorted(mylist))


mylist = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(sorted(mylist))





